tutorials/cylinderAeolianTone/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| fwhFoam tutorial: 2D cylinder Aeolian tone                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    farfield
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
