tutorials/cylinderAeolianTone/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| fwhFoam tutorial: 2D cylinder Aeolian tone                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// U = 1 m/s, D = 1 m  =>  Re = U D / nu = 100
nu              0.01;

// ************************************************************************* //
