tutorials/cylinderAeolianTone/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| fwhFoam tutorial: 2D cylinder Aeolian tone                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  16;

method              scotch;

// ************************************************************************* //
